import { FontAwesomeIcon } from '@fortawesome/react-fontawesome'
import { faPalette, faCode, faMobileScreen, faSitemap, faFilePen } from '@fortawesome/free-solid-svg-icons'
import { faFileLines } from '@fortawesome/free-regular-svg-icons'
import { faReact} from '@fortawesome/free-brands-svg-icons'
import project01 from '../assets/images/projects/project-01.jpg'
import project02 from '../assets/images/projects/project-02.jpg'
import project03 from '../assets/images/projects/project-03.jpg'
import project04 from '../assets/images/projects/project-04.jpg'
import project05 from '../assets/images/projects/project-05.jpg'
import project06 from '../assets/images/projects/project-06.jpg'
import project07 from '../assets/images/projects/project-07.jpg'
import project08 from '../assets/images/projects/project-08.jpg'
import project09 from '../assets/images/projects/project-09.jpg'

import project01Desktop from '../assets/images/projects/project1/project-01-desktop.jpg'
import project01Catalog from '../assets/images/projects/project1/project-01-catalog.jpg'
import project01Mobile from '../assets/images/projects/project1/project-01-mobile.jpg'

const projects = [
    {
        id: 1,
        slug: 'project-1',  
        title: 'REDCODE — сайт веб-студиии',
        image: project01,
        bigheader_image: project01,
        type: 'Веб-разработка',
        category: 'Корпоративный сайт',
        date: '2026',
        description: `Разработка корпоративного сайта для веб-студии, специализирующейся на создании сайтов, разработке систем дистанционного обучения и технической поддержке веб-проектов.

        Сайт предназначен для презентации услуг студии, демонстрации портфолио, информирования потенциальных клиентов и получения заявок на разработку и сопровождение сайтов.`,
        full_description: (
        <>
            <h4>О проекте</h4>
            <p>REDCODE — сайт для веб-студии, предлагающей услуги веб-разработки, создания систем дистанционного обучения и сопровождения сайтов.</p>
            <p><strong>Цель проекта</strong> — создать целостный цифровой образ компании, понятно представить её услуги, продемонстрировать выполненные работы и предоставить потенциальным клиентам удобные способы связи.</p>

            <h4>Задачи</h4>
            <ul>
                <li>Разработать структуру многостраничного сайта и систему навигации.</li>
                <li>Реализовать дизайн по готовым макетам Figma.</li>
                <li>Создать адаптивный интерфейс для мобильных устройств и компьютеров.</li>
                <li>Разработать страницы услуг, портфолио, информации о компании и контактов.</li>
                <li>Реализовать формы обратной связи и подробный бриф для потенциальных клиентов.</li>
                <li>Настроить валидацию данных, отправку заявок на электронную почту и обработку результатов отправки.</li>
                <li>Подготовить страницы к индексации поисковыми системами.</li>
            </ul>

            <h4>Реализация</h4>
            <div className="iconlist">
                <div className="iconlist__li">
                    <div className="iconlist__icon">
                        <FontAwesomeIcon icon={faReact} />
                    </div> 
                    <p>Проект разработан на React с использованием Vite и React Router. Стилизация выполнена на SCSS.</p></div>
                <div className="iconlist__li">
                    <div className="iconlist__icon">
                        <FontAwesomeIcon icon={faFileLines} />
                    </div>
                    <p>Для форм используются React Hook Form и Zod, для отправки заявок на электронную почту — EmailJS. Для управления метаданными страниц применяется react-helmet-async.</p>
                </div>
                <div className="iconlist__li">
                    <div className="iconlist__icon">
                        <FontAwesomeIcon icon={faSitemap} />
                    </div>
                    <p>Структура проекта предусматривает отдельные страницы, повторно используемые компоненты и динамические страницы проектов портфолио.</p>
                </div>
            </div>
            
            <h4>Результат</h4>
            <p>Создана основа полноценного сайта веб-студии с единой визуальной системой, многостраничной структурой и функциональностью для взаимодействия с потенциальными клиентами.</p>
        </>
        ),
        features: [
            {
                icon: faPalette,
                title: 'Дизайн и пользовательский интерфейс',
                description: 'Разработка визуальной концепции, подготовка макетов в Figma и реализация адаптивного интерфейса на React и SCSS.',    
            },
            {
                icon: faSitemap,
                title: 'Архитектура сайта',
                description: 'Многостраничная структура, маршрутизация, повторно используемые компоненты, каталог проектов и динамические страницы портфолио.',    
            },
            {   icon: faFilePen,
                title: 'Формы и взаимодействие с клиентами',
                description: 'Форма обратной связи, подробный бриф, валидация полей и отправка заявок по электронной почте.',
            },
            {
                icon: faMobileScreen,
                title: 'Адаптивность и SEO',
                description: 'Адаптация страниц для разных экранов и настройка поисковых метаданных.',       
            }
        ],
        technologies: ['React', 'React Router', 'SCSS', 'React Hook Form', 'Zod', 'EmailJS', 'SEO'],
        tasks: [
            'Разработан макет сайта и структуры страниц в Figma.',
            'Реализован интерфейс по макетам Figma',
            'Разработаны страницы услуг, о компании, контакты и портфолио',
            'Созданы динамические страницы проектов',
            'Реализованы формы обратной связи и брифа для потенциальных клиентов с валидацией',
            'Адаптирован интерфейс для разных устройств и браузеров',
            'Настроены SEO-метаданные страниц',   
        ],
        gallery: [
        {
            src: project01Desktop,
            alt: 'Главная страница сайта на компьютере',
        },
        {
            src: project01Catalog,
            alt: 'Каталог продукции',
        },
        {
            src: project01Mobile,
            alt: 'Мобильная версия сайта',
        },
        {
            src: project01Mobile,
            alt: 'Мобильная версия сайта',
        },
        ],
        link: 'https://example.com/project1',   
    },
        {
        id: 2,
        slug: 'project-2',  
        title: 'Сайт для компании по продаже и установке окон',
        image: project02,
        type: 'Веб-разработка',
        category: 'Корпоративный сайт',
        date: '2026',
        description: 'Разработка сайта для компании, занимающейся продажей и установкой окон. Сайт включает в себя каталог продукции, информацию о компании, контактные данные и форму обратной связи.',
        technologies: ['React', 'SCSS', 'Vite'],
        tasks: [
            'Разработка структуры и дизайна сайта',
            'Создание каталога продукции',
            'Адаптация для мобильных устройств',
            'Реализация формы обратной связи',
        ],
        gallery: [],
        link: 'https://example.com/project2',   
    },
        {
        id: 3,
        slug: 'project-3',  
        title: 'Сайт для компании по продаже и установке окон',
        image: project03,
        type: 'Веб-разработка',
        category: 'Корпоративный сайт',
        date: '2026',
        description: 'Разработка сайта для компании, занимающейся продажей и установкой окон. Сайт включает в себя каталог продукции, информацию о компании, контактные данные и форму обратной связи.',
        technologies: ['React', 'SCSS', 'Vite'],
        tasks: [
            'Разработка структуры и дизайна сайта',
            'Создание каталога продукции',
            'Адаптация для мобильных устройств',
            'Реализация формы обратной связи',
        ],
        gallery: [],
        link: 'https://example.com/project3',   
    },
        {
        id: 4,
        slug: 'project-4',  
        title: 'Сайт для компании по продаже и установке окон',
        image: project04,
        type: 'Веб-разработка',
        category: 'Корпоративный сайт',
        date: '2026',
        description: 'Разработка сайта для компании, занимающейся продажей и установкой окон. Сайт включает в себя каталог продукции, информацию о компании, контактные данные и форму обратной связи.',
        technologies: ['React', 'SCSS', 'Vite'],
        tasks: [
            'Разработка структуры и дизайна сайта',
            'Создание каталога продукции',
            'Адаптация для мобильных устройств',
            'Реализация формы обратной связи',
        ],
        gallery: [],
        link: 'https://example.com/project4',   
    },
        {
        id: 5,
        slug: 'project-5',  
        title: 'Сайт для компании по продаже и установке окон',
        image: project05,
        type: 'Веб-разработка',
        category: 'Корпоративный сайт',
        date: '2026',
        description: 'Разработка сайта для компании, занимающейся продажей и установкой окон. Сайт включает в себя каталог продукции, информацию о компании, контактные данные и форму обратной связи.',
        technologies: ['React', 'SCSS', 'Vite'],
        tasks: [
            'Разработка структуры и дизайна сайта',
            'Создание каталога продукции',
            'Адаптация для мобильных устройств',
            'Реализация формы обратной связи',
        ],
        gallery: [],
        link: 'https://example.com/project5',   
    },
        {
        id: 6,
        slug: 'project-6',  
        title: 'Сайт для компании по продаже и установке окон',
        image: project06,
        type: 'Веб-разработка',
        category: 'Корпоративный сайт',
        date: '2026',
        description: 'Разработка сайта для компании, занимающейся продажей и установкой окон. Сайт включает в себя каталог продукции, информацию о компании, контактные данные и форму обратной связи.',
        technologies: ['React', 'SCSS', 'Vite'],
        tasks: [
            'Разработка структуры и дизайна сайта',
            'Создание каталога продукции',
            'Адаптация для мобильных устройств',
            'Реализация формы обратной связи',
        ],
        gallery: [],
        link: 'https://example.com/project6',   
    },
        {
        id: 7,
        slug: 'project-7',  
        title: 'Сайт для компании по продаже и установке окон',
        image: project07,
        type: 'Веб-разработка',
        category: 'Корпоративный сайт',
        date: '2026',
        description: 'Разработка сайта для компании, занимающейся продажей и установкой окон. Сайт включает в себя каталог продукции, информацию о компании, контактные данные и форму обратной связи.',
        technologies: ['React', 'SCSS', 'Vite'],
        tasks: [
            'Разработка структуры и дизайна сайта',
            'Создание каталога продукции',
            'Адаптация для мобильных устройств',
            'Реализация формы обратной связи',
        ],
        gallery: [],
        link: 'https://example.com/project7',   
    },
        {
        id: 8,
        slug: 'project-8',  
        title: 'Сайт для компании по продаже и установке окон',
        image: project08,
        type: 'Веб-разработка',
        category: 'Корпоративный сайт',
        date: '2026',
        description: 'Разработка сайта для компании, занимающейся продажей и установкой окон. Сайт включает в себя каталог продукции, информацию о компании, контактные данные и форму обратной связи.',
        technologies: ['React', 'SCSS', 'Vite'],
        tasks: [
            'Разработка структуры и дизайна сайта',
            'Создание каталога продукции',
            'Адаптация для мобильных устройств',
            'Реализация формы обратной связи',
        ],
        gallery: [],
        link: 'https://example.com/project8',   
    },
        {
        id: 9,
        slug: 'project-9',  
        title: 'Сайт для компании по продаже и установке окон',
        image: project09,
        type: 'Веб-разработка',
        category: 'Корпоративный сайт',
        date: '2026',
        description: 'Разработка сайта для компании, занимающейся продажей и установкой окон. Сайт включает в себя каталог продукции, информацию о компании, контактные данные и форму обратной связи.',
        technologies: ['React', 'SCSS', 'Vite'],
        tasks: [
            'Разработка структуры и дизайна сайта',
            'Создание каталога продукции',
            'Адаптация для мобильных устройств',
            'Реализация формы обратной связи',
        ],
        gallery: [],
        link: 'https://example.com/project9',   
    },
]

export default projects;